app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "new comment"], ["post_id", 6], ["created_at", "2018-02-25 23:56:46.885960"], ["updated_at", "2018-02-25 23:56:46.885960"]]
---
  def create
    @post = Post.find(params[:post_id])
    @post.comments.create(comment_params)