app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
    def index
       @posts = Post.all.order(created_at: 'desc')

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "b"], ["created_at", "2018-02-25 14:03:52.528858"], ["updated_at", "2018-02-25 14:03:52.528858"]]
---
    def create
        # render plain: params[:post].inspect
        # save
        # @post = Post.new(params[:post])
        # @post = Post.new(params.require(:post).permit(:title, :body))
        @post = Post.new(post_params)
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "1234 update"], ["body", "1234\r\nupdate"], ["updated_at", "2018-02-25 15:06:27.126950"], ["id", 7]]
---
    def update
       @post = Post.find(params[:id])
       if @post.update(post_params)